CassiniSea/lcd-st7735-stm8s/main.c
void UI_DrawNumber(
    uint8_t x,
    uint8_t y,
    uint16_t value,
    uint16_t color,
    uint16_t bg_color
)
{
    uint8_t digits_count;
    uint8_t digit;
    uint8_t position;
    uint16_t divisor;

    if (value >= 10000)
    {
        digits_count = 5;
    }
    else if (value >= 1000)
    {
        digits_count = 4;
    }
    else if (value >= 100)
    {
        digits_count = 3;
    }
    else if (value >= 10)
    {
        digits_count = 2;
    }
    else
    {
        digits_count = 1;
    }

    /*
     * Всегда выводим поле из 5 символов.
     * Ведущие позиции просто заливаем фоном.
     */
    for (position = 0; position < 5; position++)
    {
        if (position < (5 - digits_count))
        {
            ST7735_FillRect(
                x + position * 6,
                y,
                FONT_WIDTH,
                FONT_HEIGHT,
                bg_color
            );
        }
        else
        {
            divisor = 1;

            for (digit = 1; digit < (digits_count - (position - (5 - digits_count))); digit++)
            {
                divisor *= 10;
            }

            digit = value / divisor;
            value %= divisor;

            ST7735_DrawBitmap(
                x + position * 6,
                y,
                digits[digit],
                FONT_WIDTH,
                FONT_HEIGHT,
                color,
                bg_color
            );
        }
    }
}

void UI_DrawVariable(Variable_TypeDef variable) {
	UI_DrawText(
    variable.x,
    variable.y,
    variable.label,
    variable.label_len,
    UI_TEXT_COLOR,
    UI_TEXT_BG_COLOR
	);
	
	UI_DrawNumber(
    variable.x + variable.valueIndent,
    variable.y,
    variable.value,
    UI_TEXT_COLOR,
    UI_TEXT_BG_COLOR
	);
}

void UI_DrawVariables(void) {
	uint8_t variableIndex;
	
	for (variableIndex = 0; variableIndex < VARIABLES_NUMBER; variableIndex++) {
		UI_DrawVariable(variables[variableIndex]);		
	}
}

void UI_DrawMarker(void) {
	uint8_t variableIndex;
	uint8_t markerPosition;
	uint16_t color;
	Variable_TypeDef variable;
	
	for (variableIndex = 0; variableIndex < VARIABLES_NUMBER; variableIndex++) {
		if(variableIndex == selected_variable && ui_mode == UI_MODE_SELECT)
			color = UI_MARKER_COLOR;
		else 
			color = UI_PANEL_COLOR;
		
		variable = variables[variableIndex];
		
		ST7735_FillRect(
			variable.x - 5,
			variable.y + 2,
			2,
			3,
			color
		);
		
		
		for (markerPosition = 0; markerPosition < VARIABLE_MAX_DIGITS; markerPosition++) {
			if(variableIndex == selected_variable && markerPosition == selected_digit && ui_mode == UI_MODE_EDIT)
				color = UI_MARKER_COLOR;
			else
				color = UI_PANEL_COLOR;
				
			ST7735_FillRect(
				variable.x + variable.valueIndent + (FONT_WIDTH + 1) * markerPosition + 1,
				variable.y + FONT_HEIGHT,
				3,
				2,
				color
			);			
		}
	}
}

void variablesInit(void) {
	uint8_t variableIndex;
	
	for (variableIndex = 0; variableIndex < VARIABLES_NUMBER; variableIndex++) {
		variables[variableIndex].value = eepromReadU16(
			EEPROM_DEFAULT_ADDR + 2 * variableIndex,
			0
		);
	}	
}

void graphPushValue(uint8_t newValue) {
    uint8_t i;
		
		graphGuidePosition++;			
		if (graphGuidePosition >= UI_GRAPH_GUIDE_INTERVAL)
			graphGuidePosition = 0;

    // Идем с конца массива к началу
    // Элемент [i] принимает значение элемента [i - 1]
    for (i = UI_GRAPH_WIDTH - 1; i > 0; i--) {
        graphValues[i] = graphValues[i - 1];
    }

    // Записываем новое значение в самый первый элемент
    graphValues[0] = newValue;
}

uint8_t graphScaledValue(float graphValue) {
	float relativeValue;
	
	// Ограничиваем входное значение жестко рамками [200 ... 350]
  if (graphValue > UI_GRAPH_MAX_TEMP) graphValue = UI_GRAPH_MAX_TEMP;
  if (graphValue < UI_GRAPH_MIN_TEMP) graphValue = UI_GRAPH_MIN_TEMP;
	
	// Вычитаем минимальную температуру, чтобы график начинался от UI_GRAPH_MIN_TEMP
	relativeValue = graphValue - (float)UI_GRAPH_MIN_TEMP;
	
	return UI_GRAPH_HEIGHT - (uint8_t)(relativeValue * UI_GRAPH_HEIGHT_SCALE);
}

VerticalGuidePosition_TypeDef getVerticalGuidePosition(void) {
	static VerticalGuidePosition_TypeDef verticalGuidePosition = {0, 0};
	uint16_t tempValue = variables[VARIABLE_TEMP].value;
	
	if(tempValue > UI_GRAPH_MAX_TEMP)
		tempValue = UI_GRAPH_MAX_TEMP;
	
	verticalGuidePosition.prev = verticalGuidePosition.current;
	verticalGuidePosition.current = graphScaledValue(tempValue);
	
	return verticalGuidePosition;
}

void UI_DrawGraph(void) {
	uint8_t i;
	VerticalGuidePosition_TypeDef verticalGuidePosition = getVerticalGuidePosition();
	
	ST7735_FillRect(
		2,
		0,
		1,
		UI_GRAPH_HEIGHT,
		ST7735_BLACK
	);	
	for(i = graphGuidePosition; i < UI_GRAPH_WIDTH - 1; i += UI_GRAPH_GUIDE_INTERVAL) {
		ST7735_FillRect(
			UI_GRAPH_WIDTH - i + 1,
			0,
			1,
			UI_GRAPH_HEIGHT,
			ST7735_BLACK
		);
		ST7735_FillRect(
			UI_GRAPH_WIDTH - i,
			0,
			1,
			UI_GRAPH_HEIGHT,
			UI_GRAPH_GUIDE_COLOR
		);
	}	
	
	if(verticalGuidePosition.current != verticalGuidePosition.prev) {
		ST7735_FillRect(
			0,
			verticalGuidePosition.prev,
			SCREEN_WIDTH,
			1,
			ST7735_BLACK
		);
	}
	
	ST7735_FillRect(
		0,
		verticalGuidePosition.current,
		SCREEN_WIDTH,
		1,
		UI_GRAPH_GUIDE_COLOR
	);
	
	for(i = 0; i < UI_GRAPH_WIDTH - 2; i++) {
		ST7735_FillRectByCoordinates(
			UI_GRAPH_WIDTH - i,
			graphValues[i+1],
			UI_GRAPH_WIDTH - i,
			graphValues[i+2],
			ST7735_BLACK
		);
		
		if(graphValues[i] > 0 && graphValues[i] < UI_GRAPH_HEIGHT) {				
			ST7735_FillRectByCoordinates(
				UI_GRAPH_WIDTH - i,
				graphValues[i],
				UI_GRAPH_WIDTH - i,
				graphValues[i+1],
				ST7735_RED
			);
		}
	}
	
	UI_DrawNumber(
		40,
		SCREEN_HEIGHT - 3 * (FONT_HEIGHT + 3),
		(uint16_t)temperature,
		ST7735_GREEN,
		UI_PANEL_COLOR
	);
}

void heaterOn(void) {
	GPIO_WriteLow(GPIOD, GPIO_PIN_4);
	isHeaterOn = 1;
	GPIO_WriteLow(GPIOB, GPIO_PIN_5);
}

void heaterOff(void) {
	GPIO_WriteHigh(GPIOD, GPIO_PIN_4);
	isHeaterOn = 0;
	GPIO_WriteHigh(GPIOB, GPIO_PIN_5);
}

uint8_t getButtonsState(void) {
    uint8_t state = 0;

    if (GPIO_ReadInputPin(GPIOC, GPIO_PIN_3) == RESET)
      state |= EVENT_BUTTON_1_PRESSED;
				
