CassiniSea/lcd-st7735-stm8s/main.c
		if (GPIO_ReadInputPin(GPIOC, GPIO_PIN_7) == RESET)
      state |= EVENT_BUTTON_2_PRESSED;

		if (GPIO_ReadInputPin(GPIOA, GPIO_PIN_1) == RESET)
      state |= EVENT_BUTTON_3_PRESSED;
			
		if (GPIO_ReadInputPin(GPIOA, GPIO_PIN_2) == RESET)
			state |= EVENT_BUTTON_4_PRESSED;

    return state;
}

void button1Routine(void) {
	uint16_t increment;
	
	//if(variables[VARIABLE_TEMP].value < 0xFFFF)
		//variables[VARIABLE_TEMP].value++;
		
	//UI_DrawVariable(variables[VARIABLE_TEMP]);
	
	if(ui_mode == UI_MODE_SELECT) {
		if(selected_variable > 0)
			selected_variable -= 1;
		else 
			selected_variable = VARIABLES_NUMBER - 1;
	}
	else if(ui_mode == UI_MODE_EDIT) {
    switch (selected_digit) {
			case 0: increment = 10000; break;
			case 1: increment = 1000;  break;
			case 2: increment = 100;   break;
			case 3: increment = 10;    break;
			default: increment = 1;    break;
    }
		
		if (variables[selected_variable].value > (0xFFFF - increment)) {
			variables[selected_variable].value = 0xFFFF;
		} else {
			variables[selected_variable].value += increment;
		}
		
		UI_DrawVariables();
	}
		
	UI_DrawMarker();
}

void button2Routine(void) {
	//GPIO_WriteReverse(GPIOB, GPIO_PIN_5);	
	//if(variables[VARIABLE_TEMP].value > 0)
		//variables[VARIABLE_TEMP].value--;
		
	//UI_DrawVariable(variables[VARIABLE_TEMP]);
	uint16_t decrement;
	
	if(ui_mode == UI_MODE_SELECT) {
		if(selected_variable < VARIABLES_NUMBER - 1)
			selected_variable += 1;
		else 
			selected_variable = 0;
	}
	else if(ui_mode == UI_MODE_EDIT) {
    switch (selected_digit) {
			case 0: decrement = 10000; break;
			case 1: decrement = 1000;  break;
			case 2: decrement = 100;   break;
			case 3: decrement = 10;    break;
			default: decrement = 1;    break;
    }
		
		if (decrement > variables[selected_variable].value) {
			variables[selected_variable].value = 0;
		} else {
			variables[selected_variable].value -= decrement;
		}
		
		UI_DrawVariables();
	}
		
	UI_DrawMarker();
}

void button3Routine(void) {
	//GPIO_WriteReverse(GPIOB, GPIO_PIN_5);	
	//if(variables[VARIABLE_TEMP].value < 0xFFFF - 100)
		//variables[VARIABLE_TEMP].value += 100;
		
	//UI_DrawVariable(variables[VARIABLE_TEMP]);
	if(selected_digit == 0) {
		ui_mode = UI_MODE_SELECT;
		eepromWriteU16(EEPROM_DEFAULT_ADDR + 2 * selected_variable, variables[selected_variable].value);
	}	else
		selected_digit--;
	
	UI_DrawMarker();
}

void button4Routine(void) {
	//GPIO_WriteReverse(GPIOB, GPIO_PIN_5);	
	//if(variables[VARIABLE_TEMP].value > 100)
		//variables[VARIABLE_TEMP].value -= 100;
		
	//UI_DrawVariable(variables[VARIABLE_TEMP]);
	if(ui_mode == UI_MODE_SELECT)
		ui_mode = UI_MODE_EDIT;
	else if(ui_mode == UI_MODE_EDIT) {		
		if(selected_digit < VARIABLE_MAX_DIGITS - 1)
			selected_digit++;
		else {
			variables[selected_variable].value = eepromReadU16(EEPROM_DEFAULT_ADDR + 2 * selected_variable, 0);
			UI_DrawVariables();
		}
	}
	
	UI_DrawMarker();
}

main() {
	uint8_t x;
	uint8_t test;
	
	CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1|CLK_PRESCALER_CPUDIV1);
	CLK_PeripheralClockConfig(CLK_PERIPHERAL_SPI, ENABLE);
	
	GPIO_Init(GPIOB, GPIO_PIN_4 | GPIO_PIN_5, GPIO_MODE_OUT_PP_HIGH_FAST);
	GPIO_Init(GPIOD, GPIO_PIN_4, GPIO_MODE_OUT_PP_HIGH_FAST);

	ST7735_Init();
	ST7735_SetRotation(1);
	/*	
	ST7735_SetScrollArea(
    10,
    120,
    30
	);
	*/
	
	uartInit();
	
	EXTI_SetExtIntSensitivity(
		EXTI_PORT_GPIOA,
		EXTI_SENSITIVITY_FALL_ONLY
	);	
	GPIO_Init(GPIOA, GPIO_PIN_1 | GPIO_PIN_2, GPIO_MODE_IN_PU_IT);
	
	EXTI_SetExtIntSensitivity(
		EXTI_PORT_GPIOC,
		EXTI_SENSITIVITY_FALL_ONLY
	);	
	GPIO_Init(GPIOC, GPIO_PIN_3 | GPIO_PIN_7, GPIO_MODE_IN_PU_IT);

	TIM4_TimeBaseInit(TIM4_PRESCALER_128, 125); // 1ms
	TIM4_ITConfig(TIM4_IT_UPDATE, ENABLE);
	TIM4_Cmd(ENABLE);
	
	ADC1_Init(	ADC1_CONVERSIONMODE_CONTINUOUS,
							ADC1_CHANNEL_2,
							ADC1_PRESSEL_FCPU_D4,
							ADC1_EXTTRIG_TIM,
							DISABLE,
							ADC1_ALIGN_RIGHT,
							ADC1_SCHMITTTRIG_CHANNEL3,
							DISABLE);
	ADC1_Cmd(ENABLE);
	ADC1_StartConversion();
	
	TIM1_TimeBaseInit(16000, TIM1_COUNTERMODE_UP, 1000/TIM1_FREQUENCY, 0);
	TIM1_ITConfig(TIM1_IT_UPDATE, ENABLE);
	
	enableInterrupts();
	
	ST7735_FillRect(
		0,
		0,
		SCREEN_WIDTH,
		SCREEN_HEIGHT - UI_PANEL_HEIGHT,
		ST7735_BLACK
	);
	
	ST7735_FillRect(
    0,
    SCREEN_HEIGHT - UI_PANEL_HEIGHT,
    SCREEN_WIDTH,
    UI_PANEL_HEIGHT,
    UI_PANEL_COLOR
	);
	
	/*
	ST7735_FillRect(0,   0,   40, 40, ST7735_RED);
	ST7735_FillRect(98,  0,   40, 40, ST7735_GREEN);
	ST7735_FillRect(0,   120, 40, 40, ST7735_BLUE);
	ST7735_FillRect(88,  120, 40, 40, ST7735_WHITE);
	/*
	
	/*	
	ST7735_FillRect(
    0,
    GRAPH_TOP + GRAPH_HEIGHT,
    GRAPH_WIDTH,
    SCREEN_HEIGHT - GRAPH_TOP - GRAPH_HEIGHT,
    ST7735_GREEN
	);
	*/
	
	/*
	for (x = 0; x < SCREEN_WIDTH; x += 10)	{
		ST7735_FillRect(
			x,
			GRAPH_TOP,
			5,
			GRAPH_HEIGHT,
			ST7735_RED
		);
	}
	*/
	
	variablesInit();
	
	UI_DrawVariables();
	UI_DrawMarker();
	
	isInitComplate = TRUE;
	
	TIM1_Cmd(ENABLE);
	
	while (1) {
		uint16_t heaterMarkerColor = UI_PANEL_COLOR;
		
		if(programEvent & EVENT_BUTTON_1_PRESSED) {
			button1Routine();
			programEvent &= ~EVENT_BUTTON_1_PRESSED;
		}
		
		if(programEvent & EVENT_BUTTON_2_PRESSED) {
			button2Routine();
			programEvent &= ~EVENT_BUTTON_2_PRESSED;
		}
		
		if(programEvent & EVENT_BUTTON_3_PRESSED) {
			button3Routine();
			programEvent &= ~EVENT_BUTTON_3_PRESSED;
		}
		
		if(programEvent & EVENT_BUTTON_4_PRESSED) {
			button4Routine();
			programEvent &= ~EVENT_BUTTON_4_PRESSED;
		}
		
		if(programEvent & EVENT_GRAPH_UPDATE) {
			UI_DrawGraph();			
			programEvent &= ~EVENT_GRAPH_UPDATE;
		}

		if(programEvent & EVENT_HEATER_UPDATE) {
			if(isHeaterOn)
				heaterMarkerColor = ST7735_RED;
				
			ST7735_FillRect(
				10,
				SCREEN_HEIGHT - 3 * (FONT_HEIGHT + 3),
				FONT_HEIGHT,
				FONT_HEIGHT,
				heaterMarkerColor
			);
			
			programEvent &= ~EVENT_HEATER_UPDATE;
		}
	}

}

@far @interrupt void tim1UpdateInterrupt(void) {
	static float prevTemperature = 0.0f;
	static float integralError = 0.0f;
	float rTherm, tempSpeed, predictedTemp, currentError;
	
	heaterDelay++;
	if(heaterDelay > HEATER_UPDATE_DELAY_TIM1) {
		heaterDelay = 0;
		programEvent |= EVENT_HEATER_UPDATE;
		
		rTherm = THERM_R2/(THERM_ADC_MAX/(float)ADC1_GetConversionValue() - 1);
		temperature = (THERM_BETA * (THERM_0K + 25))/(THERM_BETA + (THERM_0K + 25) * log(rTherm / THERM_R_25K)) - THERM_0K;		
		tempSpeed = temperature - prevTemperature;
		prevTemperature = temperature;
		currentError = (float)variables[VARIABLE_TEMP].value -  temperature;
		
		if (currentError < 10.0f && currentError > -10.0f) {
			integralError += currentError * (float)variables[VARIABLE_KI].value;
			
			if (integralError > I_MAX)  integralError = I_MAX;
			if (integralError < -I_MAX) integralError = -I_MAX;
			if (variables[VARIABLE_KI].value == 0) integralError = 0;			
		}
		else {
			integralError = 0.0f;
		}
		
		predictedTemp = temperature + (tempSpeed * (float)variables[VARIABLE_KD].value) - integralError;
		
		if(predictedTemp < (float)variables[VARIABLE_TEMP].value)
			heaterOn();
		else
			heaterOff();
	}
	
	graphDelay++;
	if(graphDelay > GRAPH_UPDATE_DELAY_TIM1) {
		graphDelay = 0;
		programEvent |= EVENT_GRAPH_UPDATE;
		graphPushValue(graphScaledValue(temperature));
	}
	
	TIM1_ClearITPendingBit(TIM1_IT_UPDATE);
	//graphPushValue();
	
	/*	
	scroll_position++;
	if (scroll_position >= SCREEN_HEIGHT - GRAPH_TOP) {
		scroll_position = SCREEN_HEIGHT - GRAPH_TOP - GRAPH_HEIGHT;
	}
	
	if(isInitComplate == TRUE) {	
		ST7735_SetScrollStart(scroll_position);
	}
	*/
}

@far @interrupt void tim4UpdateInterrupt(void) {
	TIM4_ClearITPendingBit(TIM1_IT_UPDATE);
	
	if (buttonsDebounce) {
    buttonsDebounce--;

    if (buttonsDebounce == 0) {
			programEvent |= getButtonsState();
    }
	}	
}

@far @interrupt void gpioaExtiInterrupt(void) {
	buttonsDebounce = BUTTONS_DEBOUNCE_LIMIT;
}

@far @interrupt void gpiocExtiInterrupt(void) {	
	buttonsDebounce = BUTTONS_DEBOUNCE_LIMIT;
}

void uartReceiveByte(uint8_t byte) {
	uartSendByte(byte);
//	ST7735_SetScrollStart((uint16_t)byte);
}